app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos"  ORDER BY "produtos"."preco" DESC
---
	def index
		@produtos = Produto.order(preco: :desc)

SELECT "departamentos".* FROM "departamentos"
---
	def new
		@produto = Produto.new
		@departamentos = Departamento.all

INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "departamento_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@produto = Produto.new produto_params
		if @produto.save

UPDATE "produtos" SET "descricao" = ?, "quantidade" = ?, "departamento_id" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["descricao", "Camiseta da série de televisão Braking Bad HUE"], ["quantidade", 10], ["departamento_id", 4], ["updated_at", "2016-03-07 01:09:39.565009"], ["id", 2]]
---
	def update
		if @produto.update produto_params

DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 5]]
---
	def destroy
		@produto.destroy

SELECT "produtos".* FROM "produtos" WHERE (nome like '%Vader%')
---
	def busca
		@nome_buscar = params[:nome]
		@produtos = Produto.where "nome like ?", "%#{@nome_buscar}%"

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT 1  [["id", 5]]
---
	def set_produto
		id = params[:id];
		@produto = Produto.find(id)